Terraform plan in __terraform__
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_function.process_events will be created
  + resource "aws_lambda_function" "process_events" {
      + arn                            = (known after apply)
      + filename                       = "./lambda_package.zip"
      + function_name                  = "process_events"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::635533433732:role/process_events"
      + runtime                        = "python3.8"
      + source_code_hash               = "7IK7mM6s5vGtafJpe7CK6tuOsCa0SuhztLltUsqtxls="
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
Plan generated in [PR Plan #13](https://github.com/dflook/terraform-github-actions-test/actions/runs/169234799)